Documentation/User_guide-technical.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Regional Module Code Documentation</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Oscar Alberto Quijano Xacur and Mohamad Elmasri" />
<link rel="stylesheet" type="text/css" href="css/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Regional Module Code Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Importing the Library</a></li>
<li><a href="#sec-2">2. Importing</a></li>
<li><a href="#sec-3">3. Preprocessing</a></li>
<li><a href="#sec-4">4. Data extraction and comments</a></li>
<li><a href="#sec-5">5. Exporting the data</a></li>
</ul>
</div>
</div>
<p>
This document explains how to process data for the RMS questionnaire
using python code instead of the GUI. 
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Importing the Library</h2>
<div class="outline-text-2" id="text-1">
<p>
First import the library <code>rmquestionnaire</code> in <code>RMS\Libraries</code>, a code example is below.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">RMS_folder</span>=<span style="color: #E6DB74;">"/home/oscar/RMS/"</span>
<span style="color: #F92672;">import</span> sys
sys.path.append(RMS_folder+<span style="color: #E6DB74;">"Libraries"</span>)
<span style="color: #F92672;">from</span> rmquestionnaire <span style="color: #F92672;">import</span> *
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Importing</h2>
<div class="outline-text-2" id="text-2">
<p>
In order to import data from a questionnaire the <code>questionnaire</code> class
should be used. Three arguments are needed when an object from this
class is defined: the excel file, the database file and the log folder.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #FD971F;">excel_file</span>=<span style="color: #E6DB74;">"Regional_Survey_2015.xlsx"</span>
<span style="color: #FD971F;">database_file</span>= RMS_folder + <span style="color: #E6DB74;">"Database/UISProd.db"</span>     <span style="color: #75715E;"># </span><span style="color: #75715E;">Concatenating the path of the main folder and the database subfolder.</span>
<span style="color: #FD971F;">log_folder</span>=<span style="color: #E6DB74;">"/tmp/log/"</span>            
<span style="color: #FD971F;">qobject</span>=questionnaire(excel_file,database_file,log_folder)
</pre>
</div>
<p>
By initiating the  <code>qobject</code> as shown above, the class reads the file to know if the questionnaire is being imported for the first time
or if it is an edited questionnaire and what Database type to use
i.e. OBS, REP or EST. Also, <code>questionnaire</code> checks that the country
name used in the file exist the database, otherwise, an error is raised.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Preprocessing</h2>
<div class="outline-text-2" id="text-3">
<p>
There is a <code>preprocessing</code> method. If the questionnaire is being
imported for the first time it reads the "Checking sheet" in the excel
file and prints if there is any <b>No</b>. 
</p>

<p>
If it is an edited questionnaire, it makes the following checks (in
the same order):
</p>

<ol class="org-ol">
<li>It checks that all the values being imported are valid.
</li>
<li>It checks that the region names exist in the database, and that
they are listed in the same order than in the original questionnaire.
</li>
<li>It checks that the parts are smaller than the total (this means
for example, the female figures are less than or equal to total figures).
</li>
<li>It checks that the region values add up to the country value.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Data extraction and comments</h2>
<div class="outline-text-2" id="text-4">
<p>
The <code>extract_data</code> method reads the values and enters them in the
database. It also writes the region names to the regions database if
an original questionnaire is being imported.
</p>

<p>
There are two different types of comments, the ones from excel that
every cell can have and the ones that are part of the questionnaire
and that are on the top of each table. The first ones we call them
cell comments and the second ones table comments. Cell comments can be
imported to the database with the  <code>extract_comments</code> method an table
comments with the <code>extract_table_comments</code> method.
</p>

<div class="org-src-container">

<pre class="src src-python">qobject.preprocessing()
qobject.extract_data()
qobject.extract_comments()
qobject.extract_table_comments()
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Exporting the data</h2>
<div class="outline-text-2" id="text-5">
<p>
In order to export the data from the database to an excel file, the
<code>xlsxwriter</code> modules needs to be used in combination with the function
<code>export_var</code>. As shown in the following example, first the excel
workbook needs to be created and then <code>export_var</code> needs to be called
for each desired sheet.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #F92672;">import</span> xlsxwriter
<span style="color: #FD971F;">co_code</span> = qobject.country_code
<span style="color: #FD971F;">co_name</span> = qobject.country_name
<span style="color: #FD971F;">year</span> = qobject.emco_year

<span style="color: #FD971F;">filename</span> = <span style="color: #E6DB74;">"{0}_{1}.xlsx"</span>.<span style="color: #F92672;">format</span>(co_name, 2012)

<span style="color: #FD971F;">wb</span> = xlsxwriter.Workbook(filename)

export_var(<span style="color: #E6DB74;">'Administrative divisions'</span>, wb, co_code, year, var_type = <span style="color: #E6DB74;">"sheet"</span>)
export_var(<span style="color: #E6DB74;">'Pupils'</span>, wb, co_code, year, var_type = <span style="color: #E6DB74;">"sheet"</span>)
export_var(<span style="color: #E6DB74;">'Teachers ISCED 1'</span>, wb, co_code, year, var_type = <span style="color: #E6DB74;">"sheet"</span>)
export_var(<span style="color: #E6DB74;">'Teachers ISCED 2'</span>, wb, co_code, year, var_type = <span style="color: #E6DB74;">"sheet"</span>)
export_var(<span style="color: #E6DB74;">'Teachers ISCED 3'</span>, wb, co_code, year, var_type = <span style="color: #E6DB74;">"sheet"</span>)
export_var(<span style="color: #E6DB74;">'Teachers ISCED 23'</span>, wb, co_code, year, var_type = <span style="color: #E6DB74;">"sheet"</span>)
wb.close()
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: August 10, 2015</p>
<p class="author">Author: Oscar Alberto Quijano Xacur and Mohamad Elmasri</p>
<p class="creator">Emacs 24.4.1 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
